trade_exp/src/InformationRegisters/ГабаритыТовара/ГабаритыТовара.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="ca127ad9-4895-4c53-b9fc-f4989b23131b">
  <name>ГабаритыТовара</name>
  <objectBelonging>Adopted</objectBelonging>
  <extension>
    <informationRegisterPeriodicity>Checked</informationRegisterPeriodicity>
    <writeMode>Checked</writeMode>
  </extension>
  <resources extendedConfigurationObject="e3f7c517-033c-4799-8b84-298669d8b4b0">
    <name>Длина</name>
    <objectBelonging>Adopted</objectBelonging>
  </resources>
  <resources extendedConfigurationObject="97531d9c-3fe9-4ff9-a8c5-c0b4ec98bb28">
    <name>Ширина</name>
    <objectBelonging>Adopted</objectBelonging>
  </resources>
  <resources extendedConfigurationObject="20612a06-7bcf-4f69-bae4-b9f2ec0aebc7">
    <name>Высота</name>
    <objectBelonging>Adopted</objectBelonging>
  </resources>
  <resources extendedConfigurationObject="3bb0c691-696e-4b28-a606-50ee8f984cea">
    <name>Вес</name>
    <objectBelonging>Adopted</objectBelonging>
  </resources>
  <dimensions extendedConfigurationObject="74272690-0c12-43c5-8153-e2f33dcd2666">
    <name>Номенклатура</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
</mdclass:InformationRegister>

trade_exp/src/InformationRegisters/ГабаритыТовара/Forms/ФормаЗагрузки/Module.bsl
#Область СобытияФормы

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	ШаблонЗаполнения = "Код номенклатуры или Наименование номенклатуры; Длина, Ширина, Высота, Вес - это число или";
	ИспользоватьКоличествоИзДокумента = "ИспользоватьКоличествоИзДокумента";   
	ШаблонЗаполненияПродолжение = "или";                                       
	Очистить = "Очистить"; 
КонецПроцедуры

#КонецОбласти

#Область Команды

&НаКлиенте
Процедура Загрузить(Команда)
	ЗагрузитьНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура КопироватьИспользоватьКоличествоИзДокумента(Команда)
	ВставитьТекстВЯчейку("ИспользоватьКоличествоИзДокумента"); 
	КопироватьВБуферОбмена("ИспользоватьКоличествоИзДокумента")
КонецПроцедуры   

&НаКлиенте
Процедура КопироватьОчистить(Команда)
	ВставитьТекстВЯчейку("Очистить");
	КопироватьВБуферОбмена("Очистить")
КонецПроцедуры

#КонецОбласти

 #Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ЗагрузитьНаСервере()
	НомерСтроки = 2;
	ЦветОшибка= Новый Цвет(255,0,0);
	
	Пока Истина Цикл
		Ошибка= Ложь;
		стрНомерСтроки= Формат(НомерСтроки, "ЧРГ=; ЧГ=0");
		
		//Читаем данные
		стрКодНоменклатуры = СокрЛП(ТабличныйДокумент.Область("R"+стрНомерСтроки+"C1").Текст);
		стрНаименованиеНоменклатуры = СокрЛП(ТабличныйДокумент.Область("R"+стрНомерСтроки+"C2").Текст);
		Если ПустаяСтрока(стрКодНоменклатуры) И ПустаяСтрока(стрНаименованиеНоменклатуры) Тогда 
			Прервать;
		КонецЕсли;
		стрДлина  = СокрЛП(ТабличныйДокумент.Область("R"+стрНомерСтроки+"C3").Текст);
		стрШирина = СокрЛП(ТабличныйДокумент.Область("R"+стрНомерСтроки+"C4").Текст);
		стрВысота = СокрЛП(ТабличныйДокумент.Область("R"+стрНомерСтроки+"C5").Текст);
        стрВес    = СокрЛП(ТабличныйДокумент.Область("R"+стрНомерСтроки+"C6").Текст);

		//Получаем значения
		Номенклатура= Справочники.Номенклатура.НайтиПоКоду(стрКодНоменклатуры);
		Если Номенклатура.Пустая() Тогда
			Номенклатура = Справочники.Номенклатура.НайтиПоНаименованию(стрНаименованиеНоменклатуры); 
		КонецЕсли;
		
		Если Номенклатура.Пустая() Тогда
				Ошибка= Истина;
				ТабличныйДокумент.Область("R"+стрНомерСтроки+"C1").ЦветФона= ЦветОшибка;
				ТабличныйДокумент.Область("R"+стрНомерСтроки+"C2").ЦветФона= ЦветОшибка;
		КонецЕсли;

		ГабаритДлина =0;
		ЗаполнитьДлину = Истина;
		ОчиститьДлину = Ложь;
		Если ПустаяСтрока(стрДлина) Тогда
			ЗаполнитьДлину = Ложь;
		Иначе
			Если стрДлина = "Очистить" Тогда
				ОчиститьДлину = Истина;
			Иначе
				Попытка
					ГабаритДлина= Число(стрДлина);
				Исключение
					Попытка
						ГабаритДлина = Перечисления.ДействияОпределенияГабаритовТовара[стрДлина];
					Исключение
						Ошибка= Истина;
						ТабличныйДокумент.Область("R"+стрНомерСтроки+"C3").ЦветФона= ЦветОшибка;
					КонецПопытки;
				КонецПопытки;
			КонецЕсли;
		КонецЕсли;
		
		ГабаритШирина = 0;
		ЗаполнитьШирину = Истина;
		ОчиститьШирину = Ложь;
		Если ПустаяСтрока(стрШирина) Тогда
			ЗаполнитьШирину = Ложь;
		Иначе
			Если стрШирина = "Очистить" Тогда
				ОчиститьШирину = Истина;
			Иначе
				Попытка
					ГабаритШирина= Число(стрШирина);
				Исключение
					Попытка
						ГабаритШирина = Перечисления.ДействияОпределенияГабаритовТовара[стрШирина];
					Исключение
						Ошибка= Истина;
						ТабличныйДокумент.Область("R"+стрНомерСтроки+"C4").ЦветФона= ЦветОшибка;
					КонецПопытки;
				КонецПопытки;
			КонецЕсли;
		КонецЕсли;
		
		ГабаритВысота=0;
		ЗаполнитьВысоту = Истина;
		ОчиститьВысоту = Ложь;
		Если ПустаяСтрока(стрВысота) Тогда		
			ЗаполнитьВысоту = Ложь;		
		Иначе	
			Если стрВысота = "Очистить" Тогда
				ОчиститьВысоту = Истина;
			Иначе
				Попытка
					ГабаритВысота= Число(стрВысота);
				Исключение
					Попытка
						ГабаритВысота = Перечисления.ДействияОпределенияГабаритовТовара[стрВысота];
					Исключение
						Ошибка= Истина;
						ТабличныйДокумент.Область("R"+стрНомерСтроки+"C5").ЦветФона= ЦветОшибка;
					КонецПопытки;
				КонецПопытки;
			КонецЕсли;	
		КонецЕсли;
		
		ГабаритВес=0;
		ЗаполнитьВес = Истина;
		ОчиститьВес = Ложь;
		Если ПустаяСтрока(стрВес) Тогда		
			ЗаполнитьВес = Ложь;		
		Иначе	
			Если стрВес = "Очистить" Тогда
				ОчиститьВес = Истина;
			Иначе
				Попытка
					ГабаритВес= Число(стрВес);
				Исключение
					Попытка
						ГабаритВес = Перечисления.ДействияОпределенияГабаритовТовара[стрВес];
					Исключение
						Ошибка= Истина;
						ТабличныйДокумент.Область("R"+стрНомерСтроки+"C6").ЦветФона= ЦветОшибка;
					КонецПопытки;
				КонецПопытки;
			КонецЕсли;	
		КонецЕсли;

		//Пишем данные
		Если Не Ошибка Тогда
			НаборЗаписей= РегистрыСведений.ГабаритыТовара.СоздатьНаборЗаписей();
			НаборЗаписей.Отбор.Номенклатура.Установить(Номенклатура);
					
			НаборЗаписей.Прочитать();
			
			Если НаборЗаписей.Количество() = 0 Тогда
				НоваяЗапись= НаборЗаписей.Добавить();
			Иначе
				НоваяЗапись= НаборЗаписей[0];
			КонецЕсли;
			
			НоваяЗапись.Номенклатура = Номенклатура;
			
			Если ЗаполнитьДлину Тогда
				НоваяЗапись.Длина= ГабаритДлина;
			ИначеЕсли ОчиститьДлину Тогда
				НоваяЗапись.Длина = Неопределено;
			КонецЕсли;
			
			Если ЗаполнитьШирину Тогда
				НоваяЗапись.Ширина= ГабаритШирина;
			ИначеЕсли ОчиститьШирину Тогда
				НоваяЗапись.Ширина = Неопределено;
			КонецЕсли;
			
			Если ЗаполнитьВысоту Тогда
				НоваяЗапись.Высота= ГабаритВысота;
			ИначеЕсли ОчиститьВысоту Тогда
				НоваяЗапись.Высота = Неопределено;
			КонецЕсли;
			
			Если ЗаполнитьВес Тогда
				НоваяЗапись.Вес= ГабаритВес;
			ИначеЕсли ОчиститьВес Тогда
				НоваяЗапись.Вес = Неопределено;
			КонецЕсли;

			НаборЗаписей.Записать();
		КонецЕсли;
		
		НомерСтроки= НомерСтроки+1;
	КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура КопироватьВБуферОбмена(Текст)
	ОбъектКопирования = Новый COMОбъект("htmlfile"); 
	ОбъектКопирования.ParentWindow.ClipboardData.SetData("Text", Текст);     
КонецПроцедуры  

&НаКлиенте
Процедура ВставитьТекстВЯчейку(Текст)
	АктивнаяЯчейка = ТабличныйДокумент.Область(ТабличныйДокумент.ТекущаяОбласть.Верх, ТабличныйДокумент.ТекущаяОбласть.Лево, ТабличныйДокумент.ТекущаяОбласть.Верх, ТабличныйДокумент.ТекущаяОбласть.Лево);	
	АктивнаяЯчейка.Текст = Текст;
КонецПроцедуры

#КонецОбласти

//&НаСервере
//Процедура ЗагрузитьНаСервере()
//	НомерСтроки = 2;
//	ЦветОшибка= Новый Цвет(255,0,0);
//	
//	Пока Истина Цикл
//		Ошибка= Ложь;
//		стрНомерСтроки= Формат(НомерСтроки, "ЧРГ=; ЧГ=0");
//		
//		//Читаем данные
//		стрНоменклатура= СокрЛП(ТабличныйДокумент.Область("R"+стрНомерСтроки+"C1").Текст);
//		Если ПустаяСтрока(стрНоменклатура) Тогда 
//			Прервать;
//		КонецЕсли;
//		стрДлина= СокрЛП(ТабличныйДокумент.Область("R"+стрНомерСтроки+"C2").Текст);
//		стрШирина= СокрЛП(ТабличныйДокумент.Область("R"+стрНомерСтроки+"C3").Текст);
//		стрВысота= СокрЛП(ТабличныйДокумент.Область("R"+стрНомерСтроки+"C4").Текст);
//	
//		//Получаем значения
//		Номенклатура= Справочники.Номенклатура.НайтиПоКоду(стрНоменклатура);
//		Если Номенклатура.Пустая() Тогда
//			Номенклатура = Справочники.Номенклатура.НайтиПоНаименованию(стрНоменклатура); 
//		КонецЕсли;
//		
//		Если Номенклатура.Пустая() Тогда
//				Ошибка= Истина;
//				ТабличныйДокумент.Область("R"+стрНомерСтроки+"C1").ЦветФона= ЦветОшибка;
//		КонецЕсли;

//		ГабаритДлина =0;
//		ЗаполнитьДлину = Истина;
//		ОчиститьДлину = Ложь;
//		Если ПустаяСтрока(стрДлина) Тогда
//			ЗаполнитьДлину = Ложь;
//		Иначе
//			Если стрДлина = "Очистить" Тогда
//				ОчиститьДлину = Истина;
//			Иначе
//				Попытка
//					ГабаритДлина= Число(стрДлина);
//				Исключение
//					Попытка
//						ГабаритДлина = Перечисления.ДействияОпределенияГабаритовТовара[стрДлина];
//					Исключение
//						Ошибка= Истина;
//						ТабличныйДокумент.Область("R"+стрНомерСтроки+"C2").ЦветФона= ЦветОшибка;
//					КонецПопытки;
//				КонецПопытки;
//			КонецЕсли;
//		КонецЕсли;
//		
//		ГабаритШирина = 0;
//		ЗаполнитьШирину = Истина;
//		ОчиститьШирину = Ложь;
//		Если ПустаяСтрока(стрШирина) Тогда
//			ЗаполнитьШирину = Ложь;
//		Иначе
//			Если стрШирина = "Очистить" Тогда
//				ОчиститьШирину = Истина;
//			Иначе
//				Попытка
//					ГабаритШирина= Число(стрШирина);
//				Исключение
//					Попытка
//						ГабаритШирина = Перечисления.ДействияОпределенияГабаритовТовара[стрШирина];
//					Исключение
//						Ошибка= Истина;
//						ТабличныйДокумент.Область("R"+стрНомерСтроки+"C3").ЦветФона= ЦветОшибка;
//					КонецПопытки;
//				КонецПопытки;
//			КонецЕсли;
//		КонецЕсли;
//		
//		ГабаритВысота=0;
//		ЗаполнитьВысоту = Истина;
//		ОчиститьВысоту = Ложь;
//		Если ПустаяСтрока(стрВысота) Тогда		
//			ЗаполнитьВысоту = Ложь;		
//		Иначе	
//			Если стрВысота = "Очистить" Тогда
//				ОчиститьВысоту = Истина;
//			Иначе
//				Попытка
//					ГабаритВысота= Число(стрВысота);
//				Исключение
//					Попытка
//						ГабаритВысота = Перечисления.ДействияОпределенияГабаритовТовара[стрВысота];
//					Исключение
//						Ошибка= Истина;
//						ТабличныйДокумент.Область("R"+стрНомерСтроки+"C4").ЦветФона= ЦветОшибка;
//					КонецПопытки;
//				КонецПопытки;
//			КонецЕсли;	
//		КонецЕсли;
//		
//		//Пишем данные
//		Если Не Ошибка Тогда
//			НаборЗаписей= РегистрыСведений.ГабаритыТовара.СоздатьНаборЗаписей();
//			НаборЗаписей.Отбор.Номенклатура.Установить(Номенклатура);
//					
//			НаборЗаписей.Прочитать();
//			
//			Если НаборЗаписей.Количество() = 0 Тогда
//				НоваяЗапись= НаборЗаписей.Добавить();
//			Иначе
//				НоваяЗапись= НаборЗаписей[0];
//			КонецЕсли;
//			
//			НоваяЗапись.Номенклатура = Номенклатура;
//			
//			Если ЗаполнитьДлину Тогда
//				НоваяЗапись.Длина= ГабаритДлина;
//			ИначеЕсли ОчиститьДлину Тогда
//				НоваяЗапись.Длина = Неопределено;
//			КонецЕсли;
//			
//			Если ЗаполнитьШирину Тогда
//				НоваяЗапись.Ширина= ГабаритШирина;
//			ИначеЕсли ОчиститьШирину Тогда
//				НоваяЗапись.Ширина = Неопределено;
//			КонецЕсли;
//			
//			Если ЗаполнитьВысоту Тогда
//				НоваяЗапись.Высота= ГабаритВысота;
//			ИначеЕсли ОчиститьВысоту Тогда
//				НоваяЗапись.Высота = Неопределено;
//			КонецЕсли;
//			
//			НаборЗаписей.Записать();
//		КонецЕсли;
//		
//		НомерСтроки= НомерСтроки+1;
//	КонецЦикла;
//КонецПроцедуры
